# import required libraries

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# load dataset

In [2]:
df = pd.read_csv("final_food_delivery_dataset.csv")
df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city_x,membership,restaurant_name_y,city_y,cuisine
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

# checking info

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_id           10000 non-null  int64
 1   user_id            10000 non-null  int64
 2   restaurant_id      10000 non-null  int64
 3   order_date         10000 non-null  object
 4   total_amount       10000 non-null  float64
 5   restaurant_name_x  10000 non-null  object
 6   name               10000 non-null  object
 7   city_x             10000 non-null  object
 8   membership         10000 non-null  object
 9   restaurant_name_y  10000 non-null  object
 10  city_y             10000 non-null  object
 11  cuisine            10000 non-null  float64
dtypes: float64(2), int64(3), object(7)
memory usage: 937.6+ KB

In [4]:
df.shape
df.isnull().sum()

order_id             0
user_id              0
restaurant_id        0
order_date           0
total_amount         0
restaurant_name_x    0
name                 0
city_x               0
membership           0
restaurant_name_y    0
city_y               0
cuisine              0
dtype: int64

In [7]:
df.columns = df.columns.str.lower().str.strip()

df = df.rename(columns={
    "city_x": "user_city",
    "city_y": "restaurant_city",
    "restaurant_name_y": "restaurant_name"
})

df["order_date"] = pd.to_datetime(df["order_date"])

df.head()

C:\Users\srira\AppData\Local\Temp\ipykernel_14072\2568782672.py:9: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df["order_date"] = pd.to_datetime(df["order_date"])

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,user_city,membership,restaurant_name,restaurant_city,cuisine
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,2023-07-15,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,2023-10-04,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,2023-12-25,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

# Q1

In [8]:
df[df.membership=="Gold"].groupby("user_city")["total_amount"].sum().sort_values(ascending=False)

user_city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

# Q2

In [9]:
df.groupby("cuisine")["total_amount"].mean().sort_values(ascending=False)

cuisine
3.6    846.775449
3.8    830.745000
4.2    826.533320
4.4    820.561374
4.6    819.616479
3.2    819.554274
4.0    813.967826
3.1    809.970657
4.3    809.208851
3.5    805.106187
4.7    803.670869
4.5    795.759186
4.8    791.465355
3.7    790.071180
3.3    785.320981
4.1    783.643724
3.4    776.125091
3.9    775.160698
3.0    770.447523
4.9    768.860345
5.0    760.411762
Name: total_amount, dtype: float64

# Q3

In [10]:
user_spend = df.groupby("user_id")["total_amount"].sum()
(user_spend > 1000).sum()

np.int64(2544)

# Q4

In [20]:
# Not available (rating missing)

# Q5

In [13]:
df[df.membership=="Gold"].groupby("user_city")["total_amount"].mean().sort_values(ascending=False)

user_city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

# Q6

In [14]:
pd.DataFrame({
    "restaurants": df.groupby("cuisine")["restaurant_id"].nunique(),
    "revenue": df.groupby("cuisine")["total_amount"].sum()
})

         restaurants    revenue
cuisine
3.0               17  255018.13
3.1               26  443863.92
3.2               31  490913.01
3.3               19  288212.80
3.4               21  339942.79
3.5               19  318822.05
3.6               17  264193.94
3.7               24  368173.17
3.8               28  466878.69
3.9               20  299987.19
4.0               20  318261.42
4.1               24  380850.85
4.2               25  423185.06
4.3               22  330966.42
4.4               21  346276.90
4.5               31  479047.03
4.6               29  495867.97
4.7               26  416301.51
4.8               41  657707.71
4.9               28  467467.09
5.0               11  159686.47

# Q7

In [15]:
round((df[df.membership=="Gold"].shape[0] / df.shape[0]) * 100)

50

# Q8

In [16]:
rest = df.groupby("restaurant_name").agg(
    avg=("total_amount","mean"),
    count=("order_id","count")
)

rest[rest["count"] < 20].sort_values("avg", ascending=False).head()

                         avg  count
restaurant_name
Restaurant_294   1040.222308     13
Restaurant_262   1029.473333     18
Restaurant_77    1029.180833     12
Restaurant_193   1026.306667     15
Restaurant_7     1002.140625     16

# Q9

In [17]:
df.groupby(["membership","cuisine"])["total_amount"].sum().sort_values(ascending=False)

membership  cuisine
Gold        4.8        347289.53
Regular     4.8        310418.18
            4.5        252644.18
Gold        4.6        251076.15
Regular     3.2        246270.15
            4.6        244791.82
Gold        3.2        244642.86
Regular     3.8        234358.08
            4.9        234217.90
Gold        4.9        233249.19
            3.8        232520.61
Regular     3.1        232308.41
Gold        4.5        226402.85
            4.7        224940.09
Regular     4.2        212469.67
Gold        3.1        211555.51
            4.2        210715.39
            3.7        195762.68
            4.1        192888.59
Regular     4.7        191361.42
            4.1        187962.26
            3.4        180701.53
Gold        4.4        177509.83
Regular     3.7        172410.49
            4.4        168767.07
            4.0        166816.02
Gold        4.3        166211.65
Regular     3.5        164762.51
            4.3        164754.77
            3.9        162805.36
Gold        3.4        159241.26
            3.5        154059.54
            4.0        151445.40
Regular     3.6        147062.51
Gold        3.3        144201.40
Regular     3.3        144011.40
Gold        3.9        137181.83
Regular     3.0        135971.08
Gold        3.0        119047.05
            3.6        117131.43
Regular     5.0         81394.42
Gold        5.0         78292.05
Name: total_amount, dtype: float64

# Q10

In [18]:
df["order_date"] = pd.to_datetime(df["order_date"], format="%d-%m-%Y")

df["quarter"] = df["order_date"].dt.quarter
df.groupby("quarter")["total_amount"].sum().sort_values(ascending=False)

quarter
3    2037385.10
4    2018263.66
1    2010626.64
2    1945348.72
Name: total_amount, dtype: float64